const testCsv = [
  [
    "チーム名",
    "1試合目の順位",
    "1試合目のキル数",
    "2試合目の順位",
    "2試合目のキル数",
    "3試合目の順位",
    "3試合目のキル数",
  ],
  ["チーム1", "1", "1", "1", "1", "1", "1"],
  ["チーム2", "2", "2", "2", "2", "2", "2"],
  ["チーム3", "3", "3", "3", "3", "3", "3"],
  ["チーム4", "4", "4", "4", "4", "4", "4"],
  ["チーム5", "5", "5", "5", "5", "5", "5"],
  ["チーム6", "6", "6", "6", "6", "6", "6"],
  ["チーム7", "7", "7", "7", "7", "7", "7"],
  ["チーム8", "8", "8", "8", "8", "8", "8"],
  ["チーム9", "9", "9", "9", "9", "9", "9"],
  ["チーム10", "10", "10", "10", "10", "10", "10"],
];

const testCsv1 = [
  [
    "チーム名",
    "1試合目の順位",
    "1試合目のキル数",
    "2試合目の順位",
    "2試合目のキル数",
    "3試合目の順位",
    "3試合目のキル数",
  ],
  ["チーム1", "1", "1", "1", "1", "1", "1", "1", "1", "1", "1"],
  ["チーム2", "2", "2", "2", "2", "2", "2", "2", "2", "2", "2"],
  ["チーム3", "3", "3", "3", "3", "3", "3", "3", "3", "3", "3"],
  ["チーム4", "4", "4", "4", "4", "4", "4", "4", "4", "4", "4"],
  ["チーム5", "5", "5", "5", "5", "5", "5", "5", "5", "5", "5"],
  ["チーム6", "6", "6", "6", "6", "6", "6", "6", "6", "6", "6"],
  ["チーム7", "7", "7", "7", "7", "7", "7", "7", "7", "7", "7"],
  ["チーム8", "8", "8", "8", "8", "8", "8", "8", "8", "8", "8"],
  ["チーム9", "9", "9", "9", "9", "9", "9", "9", "9", "9", "9"],
  ["チーム10", "10", "10", "10", "10", "10", "10", "10", "10", "10", "10"],
  ["チーム11", "11", "11", "11", "11", "11", "11", "11", "11", "11", "11"],
  ["チーム12", "12", "12", "12", "12", "12", "12", "12", "12", "12", "12"],
  ["チーム13", "13", "13", "13", "13", "13", "13", "13", "13", "13", "13"],
  ["チーム14", "14", "14", "14", "14", "14", "14", "14", "14", "14", "14"],
  ["チーム15", "15", "15", "15", "15", "15", "15", "15", "15", "15", "15"],
];

const testArray = [
  [
    "チーム名",
    "1試合目の順位",
    "1試合目のキル数",
    "2試合目の順位",
    "2試合目のキル数",
    "3試合目の順位",
    "3試合目のキル数",
  ],
  ["チーム1", "順位1", "1", "順位1", "1", "順位1", "1", "合計1"],
  ["チーム2", "順位2", "2", "順位2", "2", "順位2", "2", "合計2"],
  ["チーム3", "順位3", "3", "順位3", "3", "順位3", "3", "合計3"],
  ["チーム4", "順位4", "4", "順位4", "4", "順位4", "4", "合計4"],
  ["チーム5", "順位5", "5", "順位5", "5", "順位5", "5", "合計5"],
  ["チーム6", "順位6", "6", "順位6", "6", "順位6", "6", "合計6"],
  ["チーム7", "順位7", "7", "順位7", "7", "順位7", "7", "合計7"],
  ["チーム8", "順位8", "8", "順位8", "8", "順位8", "8", "合計8"],
  ["チーム9", "順位9", "9", "順位9", "9", "順位9", "9", "合計9"],
  ["チーム10", "順位10", "10", "順位10", "10", "順位10", "10", "合計10"],
];

const exampleArray = testCsv;
exampleArray.shift();

async function testFunc() {
  const matchCount = 3 * 2;
  const matchPoint = 2;
  const killPoint = 2;
  let FuncInArray = [];

  const teamNum = exampleArray.length;

  //規則的な順位ポイントの処理
  await new Promise((resolve) => {
    for (let x = 0; x < exampleArray.length; x++) {
      //一行に変更
      let testData = exampleArray[x];
      for (let i = 0; i < testData.length - 1; i++) {
        //奇数行の時に実行
        if (i % 2 === 1) {
          // FuncInArray.push(exData[i]);
          let mainPoint = 0;

          let rank = Number(testData[i]);
          //ポイント＝チーム数×設定したマッチポイントー順位の差
          mainPoint = matchPoint * (teamNum - rank);
          let push = mainPoint.toString();
          exampleArray[x][i] = push;
        }
      }
    }
    resolve();
  });
  console.log(exampleArray);

  //順位ポイントの計算
  await new Promise((resolve) => {
    for (let x = 0; x < exampleArray.length; x++) {
      let forInArray = exampleArray[x];
      let eqArray = [];
      for (let i = 0; i < forInArray.length; i++) {
        if (0 < i && i % 2 === 0) {
          //取得

          //代入
          eqArray.push(forInArray[i]);
          //その場所を削除

          forInArray.splice(i, 0);
        }
      }

      let killTotal = 0;
      for (let z = 0; z < eqArray.length; z++) {
        let cov = Number(eqArray[z]);
        killTotal += cov;
      }
      killTotal *= killPoint;
      eqArray.push(killTotal.toString());
      eqArray.splice(0, 0, forInArray[0]);
      console.log(eqArray);
    }
    resolve();
  });
}

testFunc();

// [
//   [チーム名,1試合目,2試合目,3試合目,キルポイント,合計]
//   ['チーム1','18','18','18','6','60'],
//   ['チーム2','16','16','16','12','60'],
// ]

// 0 2 4 6 8 10 12 14 16 18

// teamNum*killPoint - 2 * (i-1)

// let tes = Number(testCsv[1][3]);
// console.log(tes);

//
